Revit 2027 API
BuiltInFailures.CurveFailures.PeriodicCurveBadParams Property
 End positions are invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PeriodicCurveBadParams { get; }
Public Shared ReadOnly Property PeriodicCurveBadParams As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PeriodicCurveBadParams {
	FailureDefinitionId^ get ();
}
static member PeriodicCurveBadParams : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace